{
    "locales": {
        "en": {
            "title": "Education",
            "title_long_prefix": "This is my",
            "title_long": "**Educational** Background"
        },
        "es": {
            "title": "Educación",
            "title_long_prefix": "Esta es mi",
            "title_long": "**Formación** Educativa"
        }
    },
    "articles": [
        {
            "id": "academic",
            "component": "ArticleTimeline",
            "config": {},
            "locales": {},
            "items": [
                {
                    "icon": {
                        "img": "images/pictures/place-5.png",
                        "fa": "",
                        "faColors": {
                            "bg": null,
                            "fill": null
                        }
                    },
                    "dates": {
                        "start": "04/01/2017",
                        "end": "04/25/2020"
                    },
                    "locales": {
                        "en": {
                            "title": "**Bachelor** in Computer Science",
                            "info": "Central University of Venezuela (UCV)",
                            "text": "Earned a degree in Backend Development and Blockchain Technologies with a 3.8 GPA, focusing on distributed systems, microservices, and database management for blockchain applications. Gained hands-on experience by designing RESTful APIs for decentralized applications and implementing smart contract-based solutions. Completed a thesis titled <i>''Building Scalable Backend Solutions for Blockchain Applications''</i>, showcasing expertise in developing innovative backend architectures.",
                            "tags": []
                        },
                        "es": {
                            "title": "**Licenciatura** en Ciencias de la Computación",
                            "info": "Universidad Central de Venezuela (UCV)",
                            "text": "Obtuve una licenciatura en Desarrollo de Backend y Tecnologías Blockchain con un GPA de 3.8, con especialización en sistemas distribuidos, microservicios y administración de bases de datos para aplicaciones blockchain. Obtuve experiencia práctica diseñando API RESTful para aplicaciones descentralizadas e implementando soluciones basadas en contratos inteligentes. Completé una tesis titulada <i>''Construcción de soluciones escalables de backend para aplicaciones blockchain''</i>, que muestra experiencia en el desarrollo de arquitecturas de backend innovadoras.",
                            "tags": null
                        }
                    }
                }
            ]
        }
    ]
}